namespace EIP.Common.Quartz.Enums
{
    public enum EnumCalendar
    {
        //    /// <summary>
        //    /// 这个实现的日历不包括一组天。你可以用它来排除假日每年在同一日期。
        //    /// </summary>
        //    年日历,
        //    /// <summary>
        //    /// 这个实现的日历不包括一组天月。你可以用它来排除每一个1。每月为例。但是你可能定义一个月的任何一天。
        //    /// </summary>
        //    月日历,
        //    /// <summary>
        //    /// 这个实现的日历不包括一组天一周。你可以用它来排除周末为例。但是你可能定义本周任何一天。
        //    /// </summary>
        //    周日历,
        //    /// <summary>
        //    /// 这个实现的日历不包括(或包括,见下文)每天指定的时间范围。
        //    /// </summary>
        //    日常日历,
        //    /// <summary>
        //    /// 这个实现的日历存储列表的假期被排除在调度(天)。
        //    /// </summary>
        //    节假日日历,
        //    /// <summary>
        //    /// 日历的这个实现可以使用(不需要)作为基类更复杂的一个人的。只是实现了基本功能所需的每个日历。
        //    /// </summary>
        //    Base,
        /// <summary>
        /// 这个实现的日历不包括一组给定CronExpression表达的时候。
        /// </summary>
        Cron表达式
    }
}